# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

num_n = int(input("Введите число: "))
print(bin(num_n)[2:])
